Revit 2027 API
HandRailType.SupportTypeId Property
 The support type of the handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SupportTypeId { get; set; }
Public Property SupportTypeId As ElementId
	Get
	Set
public:
property ElementId^ SupportTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SupportTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The supportTypeId is not a valid rail support or invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace